In [26]:
import numpy as np
import pandas as pd

In [27]:
data={
    "Name":["Vansh","Aagman","Hemang","Krishna","Harsh"],
    "Age":[21,20,20,21,21],
    "City":["SRE","KPR","DDN","DDN","BKR"],
    "Salary":[10000000,7000000,6000000,5000000,9000000]
}

In [28]:
df = pd.DataFrame(data)

In [29]:
df

      Name  Age City    Salary
0    Vansh   21  SRE  10000000
1   Aagman   20  KPR   7000000
2   Hemang   20  DDN   6000000
3  Krishna   21  DDN   5000000
4    Harsh   21  BKR   9000000

In [30]:
data1=[
   
    ['Vansh', 21, 'SRE', 10000000],
    ['Aagman', 20, 'KPR', 7000000],
    ['Hemang', 20, 'DDN', 6000000],
    ['Krishna', 21, 'DDN', 5000000],
    ['Harsh', 21, 'BKR', 9000000]
]

In [31]:
df2 = pd.DataFrame(data1)

In [32]:
df2

         0   1    2         3
0    Vansh  21  SRE  10000000
1   Aagman  20  KPR   7000000
2   Hemang  20  DDN   6000000
3  Krishna  21  DDN   5000000
4    Harsh  21  BKR   9000000

In [33]:
columns = ["Name","Age","City","Salary"]

In [34]:
df2 = pd.DataFrame(data1,columns=columns)

In [35]:
df2

      Name  Age City    Salary
0    Vansh   21  SRE  10000000
1   Aagman   20  KPR   7000000
2   Hemang   20  DDN   6000000
3  Krishna   21  DDN   5000000
4    Harsh   21  BKR   9000000

In [37]:
df2.loc[0]

Name         Vansh
Age             21
City           SRE
Salary    10000000
Name: 0, dtype: object

In [39]:
df2.loc[[0,1]]

     Name  Age City    Salary
0   Vansh   21  SRE  10000000
1  Aagman   20  KPR   7000000

In [40]:
df2.iloc[3]

Name      Krishna
Age            21
City          DDN
Salary    5000000
Name: 3, dtype: object

SELECTING SUBSETS OF ROWS AND COLUMNS

In [45]:
df2.loc[[0,1]][["City","Salary"]]

  City    Salary
0  SRE  10000000
1  KPR   7000000

In [46]:
df2.iloc[[2,3]][["Name","Age"]]

      Name  Age
2   Hemang   20
3  Krishna   21

CONDITIONAL SELECTION

In [60]:
df2[(df2["Age"]>20) & (df2["City"]=="SRE")]

    Name  Age City    Salary
0  Vansh   21  SRE  10000000